# Data Preprocessing or Scaling

In [1]:
import os
os.getcwd()

'F:\\Machine-learning\\Assignments'

In [2]:
os.chdir('F:\\Machine-learning\\Assignments\\data_set')

In [3]:
os.getcwd()

'F:\\Machine-learning\\Assignments\\data_set'

In [4]:
import pandas as pd
df = pd.read_csv('supershops.csv')
df2 = pd.read_csv('supershops.csv')
df3 = pd.read_csv('supershops.csv')
df4 = pd.read_csv('supershops.csv')
df5 = pd.read_csv('supershops.csv')

In [5]:
df.head(5)

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [6]:
df.shape

(50, 5)

In [7]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [8]:
x = df.drop('Profit', axis=1)
y = df['Profit']

In [9]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [10]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# 1. Normalization Scaling

In [11]:
# Transform features by scaling each feature to a given range

from sklearn.preprocessing import MinMaxScaler
normal = MinMaxScaler()

In [12]:
m_fit = normal.fit(df[['Marketing Spend']])    # fit, just training model according to data

In [13]:
m_fit

MinMaxScaler()

In [14]:
df['Marketing Spend'] = normal.transform(df[['Marketing Spend']])  # fransform, finally change data

In [15]:
df['Marketing Spend'].head()

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
Name: Marketing Spend, dtype: float64

In [16]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

### shortcut way

In [17]:
df['Administration'] = normal.fit_transform( df[['Administration']] )   # fit & training at a same time

In [18]:
df.head(3)

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39

### we can change range using, feature_range=(from, to)

In [19]:
normal = MinMaxScaler(feature_range=(3,5))

In [20]:
df.Transport = normal.fit_transform( df[['Transport']] )

In [21]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   5.000000    Dhaka  192261.83
1         0.983359        0.761972   4.881787      Ctg  191792.06
2         0.927985        0.379579   4.729327  Rangpur  191050.39
3         0.873136        0.512998   4.624470    Dhaka  182901.99
4         0.859438        0.305328   4.552271  Rangpur  166187.94

# 2. Standardization feature Transformation

In [22]:
# Standardize features by removing the mean and scaling to unit variance

df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [23]:
from sklearn.preprocessing import StandardScaler
standard = StandardScaler()

In [24]:
df2['Marketing Spend'] = standard.fit_transform( df2[['Marketing Spend']] )
df2['Administration'] = standard.fit_transform( df2[['Administration']] )
df2['Transport'] = standard.fit_transform( df2[['Transport']] )

In [25]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# 3. Max absolute Value Feature Transformation

In [26]:
# Scale each feature by its maximum absolute value

df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [27]:
from sklearn.preprocessing import MaxAbsScaler
maxabs = MaxAbsScaler()

In [28]:
df3['Marketing Spend'] = maxabs.fit_transform( df3[['Marketing Spend']] )
df3['Administration'] = maxabs.fit_transform( df3[['Administration']] )
df3['Transport'] = maxabs.fit_transform( df3[['Transport']] )

In [29]:
df3.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45         0.006049        0.679748   0.004036    Dhaka  64926.08
46         0.007956        0.634104   0.629768  Rangpur  49490.75
47         0.000000        0.741474   0.000000      Ctg  42559.73
48         0.003278        0.283298   0.000000    Dhaka  35673.41
49         0.000000        0.640496   0.095749      Ctg  14681.40

# 4. Robust Scaler

In [30]:
# Robust scaler features using statistics that are robust to outliers

df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [31]:
from sklearn.preprocessing import RobustScaler
robust = RobustScaler()

In [32]:
df4['Marketing Spend'] = robust.fit_transform( df4[['Marketing Spend']] )
df4['Administration'] = robust.fit_transform( df4[['Administration']] )
df4['Transport'] = robust.fit_transform( df4[['Transport']] )

In [33]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# Another simple method, divided by max value of that column

In [34]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [35]:
df4['Marketing Spend'] = ( df4['Marketing Spend'] ) / max( df4['Marketing Spend'] )
df4['Administration'] = ( df4['Administration'] ) / max( df4['Administration'] )
df4['Transport'] = ( df4['Transport'] ) / max( df4['Transport'] )

In [36]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.449332        0.236848   1.000000    Dhaka  192261.83
1         0.970189        0.478396   0.891559      Ctg  191792.06
2         0.870987       -0.359562   0.751702  Rangpur  191050.39
3         0.772728       -0.067193   0.655513    Dhaka  182901.99
4         0.748187       -0.522273   0.589283  Rangpur  166187.94